system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (-4 0 -2)
    (0.6 0 -2)
    (-4 0.4 -2)
    (0.6 0.4 -2)
    (4 0.4 -2)    //4
    (-4 2 -2)
    (0.6 2 -2)
    (4 2 -2)      //7

    (-4 0 2)
    (0.6 0 2)
    (-4 0.4 2)
    (0.6 0.4 2)
    (4 0.4 2)    //12
    (-4 2 2)
    (0.6 2 2)
    (4 2 2)     //15

);

blocks
(
    hex (0 1 3 2 8 9 11 10) (12 8 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (12 12 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (8 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    walls
    {
        type wall;
        faces
        (
            (6 14 15 7)
            (5 13 14 6)
            (4 12 11 3)
            (3 11 9 1)
            (1 9 8 0)
            (0 2 3 1)
            (2 5 6 3)
            (3 6 7 4)
            (8 9 11 10)
            (10 11 14 13)
            (11 12 15 14)
        );
    }
    
    inlet
    {
    	type patch;
    	faces
    	(
    		(7 15 12 4)
    	);
    }
    
    outlet
    {
    	type patch;
    	faces
    	(
    		(0 8 10 2)
    		(2 10 13 5)
    	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
